<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Passages from the Ntrepid Community site.</string>
	<key>Identifier</key>
	<string>com.github.smithersjr.download.passages</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Passages</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.6.1</string>
	<key>Process</key>
        <array>
        <dict>
        	<key>Processor</key>
        	<string>URLDownloader</string>
        	 <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://download.getpassages.com/installers/Passages.pkg</string>
            </dict>
        </dict>
        <dict>
	<key>Processor</key>
	<string>EndOfCheckPhase</string>
        </dict>
        </array>
</dict>
</plist>