<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Passages from the Ntrepid Community site.</string>
	<key>Identifier</key>
	<string>com.github.smithersjr.download.passages</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Passages</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.6.1</string>
	<key>Process</key>
        <array>
        <dict>
        	<key>Processor</key>
        	<string>URLDownloader</string>
        	 <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://download.getpassages.com/installers/Passages.pkg</string>
            </dict>
        </dict>
        <dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
        </dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>flat_pkg_path</key>
				<string>%pathname%</string>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/expanded</string>
			</dict>
			<key>Processor</key>
			<string>FlatPkgUnpacker</string>
		</dict>
        <dict>
            <key>Processor</key>
            <string>PkgPayloadUnpacker</string>
            <key>Arguments</key>
            <dict>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/unpack</string>
                <key>pkg_payload_path</key>
                <string>%RECIPE_CACHE_DIR%/expanded/Passages.pkg/Payload</string>
            </dict>
        </dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_plist_path</key>
                <string>%RECIPE_CACHE_DIR%/unpack/Applications/Passages.app/Contents/Info.plist</string>
				<key>plist_version_key</key>
				<string>CFBundleShortVersionString</string>
			</dict>
			<key>Processor</key>
			<string>Versioner</string>
		</dict>
        <dict>
            <key>Processor</key>
            <string>PkgCopier</string>
            <key>Arguments</key>
            <dict>
                <key>source_pkg</key>
                <string>%pathname%</string>
                <key>pkg_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg</string>
            </dict>
		</dict>
    </array>
</dict>
</plist>